Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes
The PourMarkPropertyElementTypes class represents the available property element types for pour marks.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes.Material
Returns the material property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes.Name
Returns the name property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes.Class
Returns the class property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes.PourNumber
Returns the pour number property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes.PourType
Returns the pour type property element type.
Returns: The requested property element type.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.PourMarkPropertyElementTypes.PourConcreteMixture
Returns the contrete mixture property element type.
Returns: The requested property element type.